Былков_ДА_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/ИндивидуальныйПланЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндивидуальныйПланЛиквидацииЗадолженностей</name>
  <basedOn>Document.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</basedOn>
  <registerRecords>InformationRegister.ДатыПересдач</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>EnumRef.Время</types>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>DocumentRef.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/InformationRegisters/ДатыПересдач/ДатыПересдач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыПересдач</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПересдачи</name>
    <type>
      <types>EnumRef.Время</types>
    </type>
  </resources>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Былков_ДА_70180166/src/Documents/ИндивидуальныйПланЛиквидацииЗадолженностей/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности") Тогда
                
        // Заполнение реквизитов документа
        Группа = ДанныеЗаполнения.Группа;
        Дисциплина = ДанныеЗаполнения.Дисциплина;
        ДатаПересдачи = ДанныеЗаполнения.ЗапрашиваемыйСрок;
        ФормаКонтроля = ДанныеЗаполнения.ФормаКонтроля;
        Причина = ДанныеЗаполнения.Ссылка;
        Студент = ДанныеЗаполнения.Студент;
		
		// Проверка уникальности ИОМ
		
		ПроверитьУникальностьИОМ(ДанныеЗаполнения.Студент, ДанныеЗаполнения.Дисциплина, "", ДанныеЗаполнения.Ссылка);
	
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьИОМ(Студент, Дисциплина, ИмяСтудента = "", ДокументОснование)
    
    // Получаем имя студента, если передан студент
    Если ЗначениеЗаполнено(Студент) Тогда
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    Студенты.Наименование КАК Наименование
        |ИЗ
        |    Справочник.Студенты КАК Студенты
        |ГДЕ
        |    Студенты.Ссылка = &СсылкаНаСтудента";
        
        Запрос.УстановитьПараметр("СсылкаНаСтудента", Студент);
        Результат = Запрос.Выполнить();
        Выборка = Результат.Выбрать();
        
        Если Выборка.Следующий() Тогда
            ИмяСтудента = Выборка.Наименование;
        КонецЕсли;
	КонецЕсли;
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Ссылка КАК Ссылка,
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Дата КАК Дата,
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Номер КАК Номер,
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Причина КАК Причина
    |ИЗ
    |    Документ.ИндивидуальныйПланЛиквидацииЗадолженностей КАК ИндивидуальныйПланЛиквидацииЗадолженностей
    |ГДЕ
    |    ИндивидуальныйПланЛиквидацииЗадолженностей.Студент = &Студент
    |    И ИндивидуальныйПланЛиквидацииЗадолженностей.Дисциплина = &Дисциплина
    |    И ИндивидуальныйПланЛиквидацииЗадолженностей.ПометкаУдаления = ЛОЖЬ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Дисциплина", Дисциплина);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

   Если Выборка.Количество() > 0 Тогда
            ВызватьИсключение ("Для студента «" + Студент +"» уже существует документ «Индивидуальный план ликвидации задолженностей» по дисциплине «"+Дисциплина+ "»!");
        КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДатыПересдач
	Движения.ДатыПересдач.Записывать = Истина;
	Движение = Движения.ДатыПересдач.Добавить();
	Движение.Преподаватель = Преподаватель;
	Движение.Аудитория = Аудитория;
	Движение.Дисциплина = Дисциплина;
	Движение.ДатаВыдачи = ДатаПересдачи;
	Движение.ДатаПересдачи = ДатаПересдачи;
	Движение.ВремяПересдачи = Время;

КонецПроцедуры
